// 数据库插入语句生成器.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>
#include<stdio.h>
#include<string>
#include<string.h>
#include<stdlib.h>
using namespace std;
int main()
{
    char c[200] = "Insert into student values('g9940303', 'zhanghong', 'nv', '1985-02-08', 'g99402', 'dep_03', 'syhpq34h'); ";
    printf("你想生成的语句条数");
    int sum,d;
    scanf_s("%d", &sum);
    int i, l;
    for (i = 0; i < sum; i++)
    {
        if (c[35] != '9')
            c[35]++;
        else
        {
            c[35] = '0'; c[34]++;
        }
        if (c[34] == '3')
        {
            c[34] = '0'; c[33]++;
        }
        if (c[33] >= '9')
        {
            c[33] = '0'; c[32]++;
        }
        if (i % 2 == 1)
        {
            c[53] = 'n'; c[54] = 'v';
        }
        else
        {
            c[53] = 'n'; c[54] = 'a';
        }
        if (c[67] == '3')
        {
            c[67] == '0'; c[68] == '0';
        }

        else if (c[65] != '9'&&c[64]=='0')
        {
            c[65]++;
        }
        c[78] = i % 5+'0';
        c[88] = i % 5+'0';
        switch (i % 5) {
        case 0:c[62] = '3'; c[65] = '1'; c[68] = '0'; break;
        case 1:c[62] = '4'; c[65] = '2'; c[68] = '1'; break;
        case 2:c[62] = '6'; c[64] = '0'; c[67] = '1'; break;
        case 3:c[62] = '7'; c[65] = '1'; c[68] = '1'; break;
        case 4:c[62] = '8'; c[64] = '1'; c[67] = '3'; break;
        }
        
        printf("%s\n", c);
    }
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
